# BRepBuilderGeometryId Properties

---
The BRepBuilderGeometryId type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
BRepBuilderGeometryId Class
Autodesk.Revit.DB Namespace